---
kind: property
id: P:Autodesk.Revit.DB.Visual.Concrete.ConcreteFinish
source: html/66a123ef-e8f2-2ff6-1885-b1503b66576a.htm
---
# Autodesk.Revit.DB.Visual.Concrete.ConcreteFinish Property

The property labeled "Type" from the "Concrete" schema.

## Syntax (C#)
```csharp
public static string ConcreteFinish { get; }
```

## Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "ConcreteFinishType".